Created the IP address: 

```bash
❯ tf apply -auto-approve -target 'google_compute_global_address.k8s_io["cs"]'
Acquiring state lock. This may take a few moments...

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_compute_global_address.k8s_io["cs"] will be created
  + resource "google_compute_global_address" "k8s_io" {
      + address            = (known after apply)
      + creation_timestamp = (known after apply)
      + description        = "Used for cs-canary.k8s.io"
      + id                 = (known after apply)
      + name               = "cs-k8s-io-ingress"
      + project            = "kubernetes-public"
      + self_link          = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
google_compute_global_address.k8s_io["cs"]: Creating...
google_compute_global_address.k8s_io["cs"]: Still creating... [10s elapsed]
google_compute_global_address.k8s_io["cs"]: Creation complete after 11s [id=projects/kubernetes-public/global/addresses/cs-k8s-io-ingress]
```